In [1]:
import pandas as pd
import numpy as np
from numpy.random import randn
import string

* ### Series is just single colum of data

In [2]:
data1 = [i for i in range(10)]
data1

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [3]:
alphalist = list(string.ascii_uppercase)
print(alphalist)

['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']

In [4]:
index1 = [alphalist[i] for i in range(10)]
index1

['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J']

In [5]:
serie1 = pd.Series(data=data1,index=index1)
serie1

A    0
B    1
C    2
D    3
E    4
F    5
G    6
H    7
I    8
J    9
dtype: int64

In [6]:
dico = {k:v for k,v in zip(index1,data1) }

In [7]:
serie2 = pd.Series(dico)
serie2

A    0
B    1
C    2
D    3
E    4
F    5
G    6
H    7
I    8
J    9
dtype: int64

In [8]:
df = pd.DataFrame(randn(5,5),index='A/B/C/D/E'.split('/'), columns='V/W/X/Y/Z'.split("/"))
df

          V         W         X         Y         Z
A  0.380627  1.173043  1.746509 -0.197049  1.649166
B  1.385107  0.229252 -0.129425 -0.255587  1.016213
C -0.732804  1.102960 -0.079645 -2.080684  0.077111
D  0.893843  0.129035 -1.508771 -0.690599  0.218399
E  0.317638  0.194795  0.503104 -0.073348  1.019609

In [9]:
df.loc['D'][['X','Z']]

X   -1.508771
Z    0.218399
Name: D, dtype: float64

In [10]:
df[['X','Z']].loc['D']

X   -1.508771
Z    0.218399
Name: D, dtype: float64

In [11]:
df[['X','Z']].iloc[3]

X   -1.508771
Z    0.218399
Name: D, dtype: float64

In [12]:
df.iloc[1]['X']

-0.1294252349284254

In [13]:
df[['W','Y']]

          W         Y
A  1.173043 -0.197049
B  0.229252 -0.255587
C  1.102960 -2.080684
D  0.129035 -0.690599
E  0.194795 -0.073348

In [14]:
df.iloc[0]

V    0.380627
W    1.173043
X    1.746509
Y   -0.197049
Z    1.649166
Name: A, dtype: float64

In [15]:
df.loc['A']

V    0.380627
W    1.173043
X    1.746509
Y   -0.197049
Z    1.649166
Name: A, dtype: float64

In [16]:
# Selecting Columns
df[['V','X']]

          V         X
A  0.380627  1.746509
B  1.385107 -0.129425
C -0.732804 -0.079645
D  0.893843 -1.508771
E  0.317638  0.503104

In [17]:
df[['W','Y']]

          W         Y
A  1.173043 -0.197049
B  0.229252 -0.255587
C  1.102960 -2.080684
D  0.129035 -0.690599
E  0.194795 -0.073348

In [18]:
# We use iloc to select a particular row
df.iloc[0]

V    0.380627
W    1.173043
X    1.746509
Y   -0.197049
Z    1.649166
Name: A, dtype: float64

In [19]:
df[['X','Z']].loc[['A','B']]

          X         Z
A  1.746509  1.649166
B -0.129425  1.016213

In [20]:
df.loc[['A','B','C']]

          V         W         X         Y         Z
A  0.380627  1.173043  1.746509 -0.197049  1.649166
B  1.385107  0.229252 -0.129425 -0.255587  1.016213
C -0.732804  1.102960 -0.079645 -2.080684  0.077111

In [21]:
df[df['W']> 0]

          V         W         X         Y         Z
A  0.380627  1.173043  1.746509 -0.197049  1.649166
B  1.385107  0.229252 -0.129425 -0.255587  1.016213
C -0.732804  1.102960 -0.079645 -2.080684  0.077111
D  0.893843  0.129035 -1.508771 -0.690599  0.218399
E  0.317638  0.194795  0.503104 -0.073348  1.019609

In [22]:
df['U']  = df['V']+df['Z'] # adding new column to the data frame

In [23]:
df

          V         W         X         Y         Z         U
A  0.380627  1.173043  1.746509 -0.197049  1.649166  2.029793
B  1.385107  0.229252 -0.129425 -0.255587  1.016213  2.401320
C -0.732804  1.102960 -0.079645 -2.080684  0.077111 -0.655693
D  0.893843  0.129035 -1.508771 -0.690599  0.218399  1.112242
E  0.317638  0.194795  0.503104 -0.073348  1.019609  1.337247

In [24]:
df[df['U'] > df['V']]

          V         W         X         Y         Z         U
A  0.380627  1.173043  1.746509 -0.197049  1.649166  2.029793
B  1.385107  0.229252 -0.129425 -0.255587  1.016213  2.401320
C -0.732804  1.102960 -0.079645 -2.080684  0.077111 -0.655693
D  0.893843  0.129035 -1.508771 -0.690599  0.218399  1.112242
E  0.317638  0.194795  0.503104 -0.073348  1.019609  1.337247

In [25]:
df.head() # This will return the first five rows of the data frame

          V         W         X         Y         Z         U
A  0.380627  1.173043  1.746509 -0.197049  1.649166  2.029793
B  1.385107  0.229252 -0.129425 -0.255587  1.016213  2.401320
C -0.732804  1.102960 -0.079645 -2.080684  0.077111 -0.655693
D  0.893843  0.129035 -1.508771 -0.690599  0.218399  1.112242
E  0.317638  0.194795  0.503104 -0.073348  1.019609  1.337247

In [26]:
df.tail()# This will return the last five rows of your data frame

          V         W         X         Y         Z         U
A  0.380627  1.173043  1.746509 -0.197049  1.649166  2.029793
B  1.385107  0.229252 -0.129425 -0.255587  1.016213  2.401320
C -0.732804  1.102960 -0.079645 -2.080684  0.077111 -0.655693
D  0.893843  0.129035 -1.508771 -0.690599  0.218399  1.112242
E  0.317638  0.194795  0.503104 -0.073348  1.019609  1.337247

In [27]:
df.tail(2)

          V         W         X         Y         Z         U
D  0.893843  0.129035 -1.508771 -0.690599  0.218399  1.112242
E  0.317638  0.194795  0.503104 -0.073348  1.019609  1.337247

* # Concatinate

In [28]:
df1  = pd.DataFrame({'A':['A0','A1','A2','A3'],
                     'B':['B0','B1','B2','B3'],
                    'C':['C0','C1','C2','C3']},index =[0,1,2,3])

In [29]:
df2  = pd.DataFrame({'A':['A4','A5','A6','A7'],
                     'B':['B4','B5','B6','B7'],
                    'C':['C4','C5','C6','C7']},index =[0,1,2,3])

In [30]:
pd.concat([df1,df2])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
0  A4  B4  C4
1  A5  B5  C5
2  A6  B6  C6
3  A7  B7  C7

In [31]:
pd.concat([df1,df2],axis=1)

    A   B   C   A   B   C
0  A0  B0  C0  A4  B4  C4
1  A1  B1  C1  A5  B5  C5
2  A2  B2  C2  A6  B6  C6
3  A3  B3  C3  A7  B7  C7

# : Merging and joining data frame

* # Merging

In [86]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [87]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [88]:
df_out = pd.merge(left,right,on='key')
df_out

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [ ]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [84]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [78]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [37]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [38]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

* # Join

In [48]:
# Creating dataframe b
b = pd.DataFrame()
  
# Creating dictionary
d = {'id': [1, 2, 9, 8],
     'val1': ['p', 'q', 'r', 's']}
b = pd.DataFrame(d)
  
# printing the dataframe
b

   id val1
0   1    p
1   2    q
2   9    r
3   8    s

In [56]:
# Creating dataframe b
a = pd.DataFrame()
  
# Creating dictionary
d = {'id': [1, 2, 10, 12],
     'val2': ['a', 'b', 'c', 'd']}
a = pd.DataFrame(d)
  
# printing the dataframe
a

   id val2
0   1    a
1   2    b
2  10    c
3  12    d

In [57]:
from IPython.display import display

In [55]:
display(a,b)

   id val2
0   1    a
1   2    b
2  10    r
3  12    s

   id val1
0   1    p
1   2    q
2   9    r
3   8    s

In [58]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [62]:
display(left,right)

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [60]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

## Groupby

In [41]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[290,380,320,194,243,350]}

In [42]:
df = pd.DataFrame(data)

In [43]:
df

  Company   Person  Sales
0    GOOG      Sam    290
1    GOOG  Charlie    380
2    MSFT      Amy    320
3    MSFT  Vanessa    194
4      FB     Carl    243
5      FB    Sarah    350

** Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [44]:
df.groupby('Company')

In [45]:
df_by_comp = df.groupby("Company")

In [46]:
df_by_comp.mean()

         Sales
Company
FB       296.5
GOOG     335.0
MSFT     257.0

In [47]:
# std, min, max, describe etc..